docs/benchmark-results/sync-vs-async/raw/stage4-async-nobatch-k6-logs/insert-only-vu10.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test/large-db-insert-async.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 10m30s max duration (incl. graceful stop):
              * insert_async: 1000 iterations for each of 10 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=570.62µs min=0s med=516.59µs max=13.86ms p(90)=1.1ms  p(95)=1.51ms
      { expected_response:true }...: avg=570.62µs min=0s med=516.59µs max=13.86ms p(90)=1.1ms  p(95)=1.51ms
    http_req_failed................: 0.00%  0 out of 10000
    http_reqs......................: 10000  13743.618838/s

    EXECUTION
    iteration_duration.............: avg=705.23µs min=0s med=538.2µs  max=18.58ms p(90)=1.47ms p(95)=1.82ms
    iterations.....................: 10000  13743.618838/s

    NETWORK
    data_received..................: 732 kB 1.0 MB/s
    data_sent......................: 1.4 MB 2.0 MB/s



running (00m00.7s), 00/10 VUs, 10000 complete and 0 interrupted iterations
insert_async ✓ [ 100% ] 10 VUs  00m00.7s/10m0s  10000/10000 iters, 1000 per VU