docs/benchmark-results/sync-vs-async/raw/stage4-async-nobatch-k6-logs/insert-only-vu50.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test/large-db-insert-async.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 10m30s max duration (incl. graceful stop):
              * insert_async: 200 iterations for each of 50 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=1.38ms min=0s med=1ms max=21.52ms p(90)=2.8ms  p(95)=4.43ms
      { expected_response:true }...: avg=1.38ms min=0s med=1ms max=21.52ms p(90)=2.8ms  p(95)=4.43ms
    http_req_failed................: 0.00%  0 out of 10000
    http_reqs......................: 10000  24600.397296/s

    EXECUTION
    iteration_duration.............: avg=1.83ms min=0s med=1ms max=24.54ms p(90)=4.01ms p(95)=6.28ms
    iterations.....................: 10000  24600.397296/s

    NETWORK
    data_received..................: 732 kB 1.8 MB/s
    data_sent......................: 1.4 MB 3.5 MB/s



running (00m00.4s), 00/50 VUs, 10000 complete and 0 interrupted iterations
insert_async ✓ [ 100% ] 50 VUs  00m00.4s/10m0s  10000/10000 iters, 200 per VU